###############################################################################
# Created by write_sdc
# Tue Jan  9 17:53:20 2024
###############################################################################
current_design HRALM4
###############################################################################
# Timing Constraints
###############################################################################
create_clock -name clk -period 800.0000 [get_ports {clk}]
set_input_delay 80.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rst}]
set_input_delay 80.0000 -clock [get_clocks {clk}] -add_delay [get_ports {x[0]}]
set_input_delay 80.0000 -clock [get_clocks {clk}] -add_delay [get_ports {x[10]}]
set_input_delay 80.0000 -clock [get_clocks {clk}] -add_delay [get_ports {x[11]}]
set_input_delay 80.0000 -clock [get_clocks {clk}] -add_delay [get_ports {x[12]}]
set_input_delay 80.0000 -clock [get_clocks {clk}] -add_delay [get_ports {x[13]}]
set_input_delay 80.0000 -clock [get_clocks {clk}] -add_delay [get_ports {x[14]}]
set_input_delay 80.0000 -clock [get_clocks {clk}] -add_delay [get_ports {x[15]}]
set_input_delay 80.0000 -clock [get_clocks {clk}] -add_delay [get_ports {x[1]}]
set_input_delay 80.0000 -clock [get_clocks {clk}] -add_delay [get_ports {x[2]}]
set_input_delay 80.0000 -clock [get_clocks {clk}] -add_delay [get_ports {x[3]}]
set_input_delay 80.0000 -clock [get_clocks {clk}] -add_delay [get_ports {x[4]}]
set_input_delay 80.0000 -clock [get_clocks {clk}] -add_delay [get_ports {x[5]}]
set_input_delay 80.0000 -clock [get_clocks {clk}] -add_delay [get_ports {x[6]}]
set_input_delay 80.0000 -clock [get_clocks {clk}] -add_delay [get_ports {x[7]}]
set_input_delay 80.0000 -clock [get_clocks {clk}] -add_delay [get_ports {x[8]}]
set_input_delay 80.0000 -clock [get_clocks {clk}] -add_delay [get_ports {x[9]}]
set_input_delay 80.0000 -clock [get_clocks {clk}] -add_delay [get_ports {y[0]}]
set_input_delay 80.0000 -clock [get_clocks {clk}] -add_delay [get_ports {y[10]}]
set_input_delay 80.0000 -clock [get_clocks {clk}] -add_delay [get_ports {y[11]}]
set_input_delay 80.0000 -clock [get_clocks {clk}] -add_delay [get_ports {y[12]}]
set_input_delay 80.0000 -clock [get_clocks {clk}] -add_delay [get_ports {y[13]}]
set_input_delay 80.0000 -clock [get_clocks {clk}] -add_delay [get_ports {y[14]}]
set_input_delay 80.0000 -clock [get_clocks {clk}] -add_delay [get_ports {y[15]}]
set_input_delay 80.0000 -clock [get_clocks {clk}] -add_delay [get_ports {y[1]}]
set_input_delay 80.0000 -clock [get_clocks {clk}] -add_delay [get_ports {y[2]}]
set_input_delay 80.0000 -clock [get_clocks {clk}] -add_delay [get_ports {y[3]}]
set_input_delay 80.0000 -clock [get_clocks {clk}] -add_delay [get_ports {y[4]}]
set_input_delay 80.0000 -clock [get_clocks {clk}] -add_delay [get_ports {y[5]}]
set_input_delay 80.0000 -clock [get_clocks {clk}] -add_delay [get_ports {y[6]}]
set_input_delay 80.0000 -clock [get_clocks {clk}] -add_delay [get_ports {y[7]}]
set_input_delay 80.0000 -clock [get_clocks {clk}] -add_delay [get_ports {y[8]}]
set_input_delay 80.0000 -clock [get_clocks {clk}] -add_delay [get_ports {y[9]}]
set_output_delay 80.0000 -clock [get_clocks {clk}] -add_delay [get_ports {p[0]}]
set_output_delay 80.0000 -clock [get_clocks {clk}] -add_delay [get_ports {p[10]}]
set_output_delay 80.0000 -clock [get_clocks {clk}] -add_delay [get_ports {p[11]}]
set_output_delay 80.0000 -clock [get_clocks {clk}] -add_delay [get_ports {p[12]}]
set_output_delay 80.0000 -clock [get_clocks {clk}] -add_delay [get_ports {p[13]}]
set_output_delay 80.0000 -clock [get_clocks {clk}] -add_delay [get_ports {p[14]}]
set_output_delay 80.0000 -clock [get_clocks {clk}] -add_delay [get_ports {p[15]}]
set_output_delay 80.0000 -clock [get_clocks {clk}] -add_delay [get_ports {p[16]}]
set_output_delay 80.0000 -clock [get_clocks {clk}] -add_delay [get_ports {p[17]}]
set_output_delay 80.0000 -clock [get_clocks {clk}] -add_delay [get_ports {p[18]}]
set_output_delay 80.0000 -clock [get_clocks {clk}] -add_delay [get_ports {p[19]}]
set_output_delay 80.0000 -clock [get_clocks {clk}] -add_delay [get_ports {p[1]}]
set_output_delay 80.0000 -clock [get_clocks {clk}] -add_delay [get_ports {p[20]}]
set_output_delay 80.0000 -clock [get_clocks {clk}] -add_delay [get_ports {p[21]}]
set_output_delay 80.0000 -clock [get_clocks {clk}] -add_delay [get_ports {p[22]}]
set_output_delay 80.0000 -clock [get_clocks {clk}] -add_delay [get_ports {p[23]}]
set_output_delay 80.0000 -clock [get_clocks {clk}] -add_delay [get_ports {p[24]}]
set_output_delay 80.0000 -clock [get_clocks {clk}] -add_delay [get_ports {p[25]}]
set_output_delay 80.0000 -clock [get_clocks {clk}] -add_delay [get_ports {p[26]}]
set_output_delay 80.0000 -clock [get_clocks {clk}] -add_delay [get_ports {p[27]}]
set_output_delay 80.0000 -clock [get_clocks {clk}] -add_delay [get_ports {p[28]}]
set_output_delay 80.0000 -clock [get_clocks {clk}] -add_delay [get_ports {p[29]}]
set_output_delay 80.0000 -clock [get_clocks {clk}] -add_delay [get_ports {p[2]}]
set_output_delay 80.0000 -clock [get_clocks {clk}] -add_delay [get_ports {p[30]}]
set_output_delay 80.0000 -clock [get_clocks {clk}] -add_delay [get_ports {p[31]}]
set_output_delay 80.0000 -clock [get_clocks {clk}] -add_delay [get_ports {p[3]}]
set_output_delay 80.0000 -clock [get_clocks {clk}] -add_delay [get_ports {p[4]}]
set_output_delay 80.0000 -clock [get_clocks {clk}] -add_delay [get_ports {p[5]}]
set_output_delay 80.0000 -clock [get_clocks {clk}] -add_delay [get_ports {p[6]}]
set_output_delay 80.0000 -clock [get_clocks {clk}] -add_delay [get_ports {p[7]}]
set_output_delay 80.0000 -clock [get_clocks {clk}] -add_delay [get_ports {p[8]}]
set_output_delay 80.0000 -clock [get_clocks {clk}] -add_delay [get_ports {p[9]}]
###############################################################################
# Environment
###############################################################################
###############################################################################
# Design Rules
###############################################################################
